grekichi/raspberry_pi_asm/rp2040/uart/get_gps/get_gps.c
#include "rp2040.h"
#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>

void PUT32(uint32_t, uint32_t);
uint32_t GET32(uint32_t);
void WFI(void);

static void clock_init(void)
{
    // 125MHzに設定する
    PUT32(CLK_SYS_RESUS_CTRL_RW, 0x00);             // RESUS無効化、time out を0サイクルに設定
    PUT32(XOSC_CTRL_RW, 0xAA0 | (0xFAB << 12));     // 水晶発振器を1-15MHzレンジに設定、水晶発振器enable
    PUT32(XOSC_STARTUP_RW, 0xC4);                   // 256 * 196 = 50176 cycles に設定
    while (!(GET32(XOSC_STATUS_RW) & 0x80000000));  // 発振器の動作確認
    PUT32(CLK_REF_CTRL_RW, 0x2);                    // SRC -> XOSC_CLKSRC

    // PLL_SYSのリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 12); // ビット12がPLL_SYSに相当
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 12)));

    // PLL_SYSを125MHzに設定する
    PUT32(PLL_SYS_PWR_RW, (1 << 5) | (1 << 3) | (1 << 0));  // PWR 電源off
    PUT32(PLL_SYS_CS_RW, 0);                                // REFDIV=1
    PUT32(PLL_SYS_FBDIV_INT_RW, 125);                       // VCO=1500MHz *63に設定して、PD2=1にすると同等設定で消費電力を抑えられる
    PUT32(PLL_SYS_PWR_RW, 1 << 3);                          // POSTDIVPD=1で保持
    while (!(GET32(PLL_SYS_CS_RW) & (1 << 31)));            // PLLのロック状況を確認
    PUT32(PLL_SYS_PRIM_RW, (6 << 16) | (2 << 12));          // PD1->6, PD2->2
    PUT32(PLL_SYS_PWR_RW, 0);                               // Power -> on, PD=0, VCOPD=0, POSTDIVPD=0

    PUT32(CLK_SYS_CTRL_CLR, 1 << 0);                 // SRCを一旦CLK_REF(=XOSC)に退避する
    PUT32(CLK_SYS_CTRL_CLR, 0x7 << 5);               // AUXSRC 7:5bits クリア -> PLL_SYS
    PUT32(CLK_SYS_CTRL_RW, (0x0 << 5) | (0x1 << 0)); // AUXSRC -> PLL_SYS, CLKSRC_CLK_SYS_AUX

    PUT32(CLK_PERI_CTRL_CLR, 0x7 << 5);              // AUXSRC 7:5bits クリア -> CLK_SYS
    PUT32(CLK_PERI_CTRL_RW, (1 << 11) | (0x1 << 5)); // enable, CLKSRC_PLL_SYS
    // clk_periの有効待ち
    while (!(GET32(CLK_PERI_CTRL_RW) & (1 << 11)));

    // ウォッチドッグの設定(1MHz(=1μs)に設定)
    PUT32(WATCHDOG_TICK_RW, ((1 << 9) | 12)); // clk_tickはclk_refベースのため、XOSCの12(MHz)を設定
}

static void reset_subsys(void)
{
    // IO_BANK0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 5); // ビット５がIO_BANK0に相当
    // IO_BANK0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 5)));

    // PADS_BANK0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_CLR, 1 << 8); // ビット8がPADS_BANK0に相当
    // PADS_BANK0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 8)));

    // I2C0のリセット状態を解除する（=使える状態にする）
    PUT32(RESETS_RESET_SET, 1 << 3); // ビット3がI2C0に相当
    PUT32(RESETS_RESET_CLR, 1 << 3); // ビット3がI2C0に相当
    // I2C0のリセットが完了していればループを抜ける
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 3)));
}

static void delay_us(uint32_t microsec)
{
    uint32_t start = GET32(TIMER_TIMERAWL_RW);
    while ((GET32(TIMER_TIMERAWL_RW) - start) < microsec);
}

static void delay_ms(uint32_t millisec)
{
    uint32_t start = GET32(TIMER_TIMERAWL_RW);
    while ((GET32(TIMER_TIMERAWL_RW) - start) < (millisec * 1000));
}

static void led_init(void)
{
    uint32_t ra;

    // *PicoW用にGPIO20とする
    PUT32(SIO_GPIO_OE_CLR, 1 << 20);  // GPIO25出力を無効化（初期化のための安全動作）
    PUT32(SIO_GPIO_OUT_CLR, 1 << 20); // GPIO25の値をクリア
    ra = GET32(PADS_BANK0_GPIO20_RW);
    ra ^= 0x40; // if input disabled then enable
    ra &= 0xC0; // if output disabled then enable
    PUT32(PADS_BANK0_GPIO20_XOR, ra);
    PUT32(IO_BANK0_GPIO20_CTRL_RW, 5); // SIO
    PUT32(SIO_GPIO_OE_SET, 1 << 20);   // GPIO25出力を有効化
}

// baudrate=9600の場合  : ibrd->813, fbrd->52
// baudrate=57600の場合 : ibrd->135, fbrd->41
// baudrate=115200の場合: ibrd-> 67, fbrd->53
static void set_uart1_baudrate(uint32_t ibrd, uint32_t fbrd)
{
    PUT32(UART1_CR_RW, 0x00000000); // UART1を一旦無効化

    PUT32(UART1_IBRD_RW, ibrd); // 整数ボーレート分周値
    PUT32(UART1_FBRD_RW, fbrd); // 小数ボーレート分周値

    // 0 11 1 0 0 0 0 = (0111 0000) が設定値
    PUT32(UART1_LCR_H_RW, 0x70);                        // １フレームのデータビット数 8bits, FIFO有効化, パリティビットなし
    PUT32(UART1_CR_RW, (1 << 9) | (1 << 8) | (1 << 0)); // TXE:有効、RXE:有効
}

static void uart0_init(void)
{
    PUT32(RESETS_RESET_CLR, (1 << 22)); // UART0のリセットを解除
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 22)));

    PUT32(UART0_CR_RW, 0x00000000); // UART初期化
    // ボーレート分周器の設定
    // 水晶発振器(XOSC)使用のため、clk_periの周波数は、125MHz = (125 * 10^6)
    // 通信速度(ボーレート)は、115200 bps に設定
    // 計算方法: clk_periの周波数 / (ボーレート * 16倍)
    // 割った結果の小数部分は、64倍した値を小数ボーレート分周値とする
    // 125000000 / (16 * 115200) = 67.8168
    // 0.8168 * 64 = 52.2752 -> 52.2752+ 0.5 = 52.7752
    PUT32(UART0_IBRD_RW, 67); // 整数ボーレート分周値
    PUT32(UART0_FBRD_RW, 53); // 小数ボーレート分周値

    // 0 11 1 0 0 0 0 = (0111 0000) が設定値
    PUT32(UART0_LCR_H_RW, 0x70);                        // １フレームのデータビット数 8bits, FIFO有効化, パリティビットなし
    PUT32(UART0_CR_RW, (1 << 9) | (1 << 8) | (1 << 0)); // TXE:有効、RXE:有効

    // GPIO0の設定
    PUT32(PADS_BANK0_GPIO0_CLR, (1 << 7) | (1 << 6)); // OD/IE -> disable
    PUT32(PADS_BANK0_GPIO0_SET, 1 << 3);              // Pull up enable
    PUT32(IO_BANK0_GPIO0_CTRL_RW, 2);                 // UART0_TX

    // GPIO1の設定
    PUT32(PADS_BANK0_GPIO1_SET, 1 << 6); // IE enable
    PUT32(PADS_BANK0_GPIO1_SET, 1 << 3); // Pull up enable
    PUT32(IO_BANK0_GPIO1_CTRL_RW, 2);    // UART0_RX
}

static void uart1_init(void)
{
    PUT32(RESETS_RESET_CLR, (1 << 23)); // UART1のリセットを解除
    while (!(GET32(RESETS_RESET_DONE_RW) & (1 << 23)));

    PUT32(UART1_CR_RW, 0x00000000); // UART1初期化
    // ボーレート分周器の設定
    // 水晶発振器(XOSC)使用のため、clk_periの周波数は、125MHz = (125 * 10^6)
    // 通信速度(ボーレート)は、起動時のみ一旦 9600 bps に設定
    // 計算方法: clk_periの周波数 / (ボーレート * 16倍)
    // 割った結果の小数部分は、64倍した値を小数ボーレート分周値とする
    // 125000000 / (16 * 9600) = 813.8021
    // 0.8021 * 64 = 51.3344 -> + 0.5 = 51.8344
    PUT32(UART1_IBRD_RW, 813); // 整数ボーレート分周値
    PUT32(UART1_FBRD_RW, 52); // 小数ボーレート分周値

    // 0 11 1 0 0 0 0 = (0111 0000) が設定値
    PUT32(UART1_LCR_H_RW, 0x70);                        // １フレームのデータビット数 8bits, FIFO有効化, パリティビットなし
    PUT32(UART1_CR_RW, (1 << 9) | (1 << 8) | (1 << 0)); // TXE:有効、RXE:有効

    // GPIO8の設定
    PUT32(PADS_BANK0_GPIO8_CLR, (1 << 7) | (1 << 6)); // OD/IE -> disable
    PUT32(PADS_BANK0_GPIO8_SET, 1 << 3);              // Pull up enable
    PUT32(IO_BANK0_GPIO8_CTRL_RW, 2);                 // UART1_TX

    // GPIO9の設定
    PUT32(PADS_BANK0_GPIO9_SET, 1 << 6); // IE enable
    PUT32(PADS_BANK0_GPIO9_SET, 1 << 3); // Pull up enable
    PUT32(IO_BANK0_GPIO9_CTRL_RW, 2);    // UART1_RX
}

static void uart_send(uint32_t x)
{
    while (GET32(UART0_FR_RW) & (1 << 5));
    PUT32(UART0_DR_RW, x);
}

static void uart_send_char(uint8_t x)
{
    while (GET32(UART0_FR_RW) & (1 << 5));
    PUT32(UART0_DR_RW, x);
}

static void uart_send_str(uint8_t *y)
{
    while (*y != '\0')
    {
        uart_send_char(*y);
        y++;
    }
}

static void uart_line_break(void)
{
    uart_send_char('\r');
    uart_send_char('\n');
    uart_send_char('\n');
}

static inline void char2bin8(uint8_t val, uint8_t *buf)
{
    uint8_t u = (uint8_t)val;

    for (int i = 0; i < 8; i++)
    {
        buf[i] = ((u >> (7 - i)) & 1) ? '1' : '0';
    }
    buf[8] = '\0';
}

