grekichi/raspberry_pi_asm/rp2040/uart/get_gps/get_gps.c
static inline void short2bin16(int16_t val, uint8_t *buf)
{
    uint16_t u = (uint16_t)val;

    for (int i = 0; i < 16; i++)
    {
        buf[i] = ((u >> (15 - i)) & 1) ? '1' : '0';
    }
    buf[16] = '\0';
}

static inline void int2bin32(uint32_t val, uint8_t *buf)
{
    uint32_t u = (uint32_t)val;

    for (int i = 0; i < 32; i++)
    {
        buf[i] = ((u >> (31 - i)) & 1) ? '1' : '0';
    }
    buf[32] = '\0';
}

static inline void int2str(int32_t value, uint8_t *buf)
{
    uint8_t i = 0;
    uint32_t uvalue;

    // 負の数の処理
    if (value < 0) {
        buf[i++] = '-';
        // 絶対値を取得 (int32_tの最小値対策としてキャストしてから反転)
        uvalue = (uint32_t)-(value + 1) + 1;
    } else {
        uvalue = (uint32_t)value;
    }

    // 桁毎に処理
    uint32_t tens[] = {1000, 100, 10, 1}; //  今回は1000の位まで使用
    uint8_t started = 0;

    for (int j = 0; j < 4; j++)
    {
        uint8_t digit = 0;

        while (uvalue >= tens[j])
        {
            uvalue -= tens[j];
            digit++;
        }

        if (digit > 0 || started || j == 3)
        {
            buf[i++] = digit + '0';
            started = 1;
        }
    }

    buf[i] = '\0';
}

static inline void int2str_for_gps(uint32_t val, uint8_t *buf)
{
    uint32_t tens[] = {10000, 1000, 100, 10, 1};
    uint8_t idx = 0;

    for (int j = 0; j < 6; j++)
    {
        uint8_t digit = 0;
        while (val >= tens[j])
        {
            val -= tens[j];
            digit++;
        }
        buf[idx++] = digit + '0';
    }
    buf[idx] = '\0';
}

// 主に加速度データのキャラクタ化に使用
static inline void short2str(int16_t value, uint8_t *buf)
{
    uint8_t i = 0;
    uint16_t u_val;

    if (value < 0)
    {
        buf[i++] = '-';
        u_val = (uint16_t)(-(value + 1)) + 1;
    }
    else
    {
        u_val = (uint16_t)value;
    }

    // 各桁の重みテーブル
    static const uint16_t powers[] = {10000, 1000, 100, 10, 1};
    uint8_t started = 0;

    for (uint8_t p = 0; p < 5; p++)
    {
        uint8_t digit = 0;
        uint16_t weight = powers[p];

        // 引き算だけで商を求める
        while (u_val >= weight)
        {
            u_val -= weight;
            digit++;
        }

        // ゼロ抑制の判定
        // すでに数字が始まっているか、現在の桁が0でないか、最後の一の位なら書き込む
        if (started || digit > 0 || p == 4)
        {
            buf[i++] = digit + '0';
            started = 1;
        }
    }

    buf[i] = '\0';
}

static inline void char2str(int8_t value, uint8_t *buf)
{
    uint8_t i = 0;
    uint8_t u_val;

    // 1. 負の数の処理
    if (value < 0)
    {
        buf[i++] = '-';
        // -128を正数に反転させる際のオーバーフロー対策
        u_val = (uint8_t)(-(value + 1)) + 1;
    }
    else
    {
        u_val = (uint8_t)value;
    }

    // 2. 桁の計算（100の位, 10の位, 1の位）
    uint8_t started = 0;

    // 100の位
    uint8_t hundreds = 0;
    while (u_val >= 100) {
        u_val -= 100;
        hundreds++;
    }
    if (hundreds > 0) {
        buf[i++] = (uint8_t)(hundreds + '0');
        started = 1;
    }

    // 10の位
    uint8_t tens = 0;
    while (u_val >= 10) {
        u_val -= 10;
        tens++;
    }
    // すでに上の桁があるか、10の位が1以上なら書き込む
    if (started || tens > 0) {
        buf[i++] = (uint8_t)(tens + '0');
    }

    // 1の位 (0であっても必ず書き込む)
    buf[i++] = (uint8_t)(u_val + '0');

    // 3. 終端文字 
    buf[i] = '\0';
}

static inline void frac2str(int32_t value, uint8_t precision, uint8_t *buf)
{
    // *** 本関数の使用方法 ********************************************************
    //  本関数は、小数点第3位まで対応
    //
    // 小数点第１位の数字の文字列を作成したい場合
    // 10倍の固定小数点数を作る: (value * 10) / 16384
    // int32_t g_fixed1 = ((int32_t)my_sensor.acc[0] * 10) >> 14;
    // frac2str(g_fixed1, 1, buffer); -> 結果は 0.9 や 1.5 など
    //    
    // 小数点第2位の数字の文字列を作成したい場合
    // 100倍の固定小数点数を作る: (value * 100) / 16384 => (value * 25) / 4096
    // int32_t g_fixed2 = ((int32_t)my_sensor.acc[1] * 25) >> 12;
    // frac2str(g_fixed2, 2, buffer); -> 結果は 0.98 や 1.50 など
    // ***************************************************************************

    uint8_t i = 0;
    uint32_t u_val;

    // 負の数の処理
    if (value < 0)
    {
        buf[i++] = '-';
        u_val = (uint32_t)(-value);
    }
    else
    {
        u_val = (uint32_t)value;
    }

    // 整数部と小数部の分離
    uint32_t integer = 0;
    uint32_t fraction = 0;

    if (precision == 3)
    {
        // 100で割る代わりにループで引く
        while (u_val >= 1000)
        {
            u_val -= 1000;
            integer++;
        }
        fraction = u_val; // 0-999
    }
    else if (precision == 2)
    {
        // 100で割る代わりにループで引く
        while (u_val >= 100)
        {
            u_val -= 100;
            integer++;
        }
        fraction = u_val; // 0-99
    }
    else
    {
        // precision == 1 (10で割る代わりにループで引く)
        while (u_val >= 10)
        {
            u_val -= 10;
            integer++;
        }
        fraction = u_val; // 0-9
    }

    // 整数部の変換(0なら'0'、それ以外は桁バラシ)
    if (integer == 0)
    {
        buf[i++] = '0';
    }
    else
    {
        uint32_t divisor = 10000; // 必要に応じて 100000 などに調整
        uint8_t started = 0;
        while (divisor > 0)
        {
            uint8_t digit = 0;
            while (integer >= divisor)
            {
                integer -= divisor;
                digit++;
            }
            if (started || digit > 0 || divisor == 1)
            {
                buf[i++] = digit + '0';
                started = 1;
            }
            // divisor /= 10 の代わり（除算したくないため）
            if      (divisor == 10000)  divisor = 1000;
            else if (divisor == 1000)   divisor = 100;
            else if (divisor == 100)    divisor = 10;
            else if (divisor == 10)     divisor = 1;
            else                        divisor = 0;
        }
    }

    // 小数点の追加
    buf[i++] = '.';

    // 小数部の変換（指定桁数分、0埋めありで出力）
    if (precision == 3)
    {
        // 100の位を抽出
        uint8_t f100 = 0;
        while (fraction >= 100)
        {
            fraction -= 100;
            f100++;
        }
        buf[i++] = f100 + '0';
        // 10の位を抽出
        uint8_t f10 = 0;
        while (fraction >= 10)
        {
            fraction -= 10;
            f10++;
        }
        buf[i++] = f10 + '0';
        // 1の位
        buf[i++] = fraction + '0'; // 残りが1の位
    }
    else if (precision == 2)
    {
        // 10の位を抽出
        uint8_t f10 = 0;
        while (fraction >= 10)
        {
            fraction -= 10;
            f10++;
        }
        buf[i++] = f10 + '0';
        // 1の位
        buf[i++] = fraction + '0'; // 残りが1の位
    }
    else
    {
        // precision == 1 の場合はそのまま１桁
        buf[i++] = fraction + '0';
    }

    // 終端文字
    buf[i] = '\0';
}

static inline void frac2str4gps(int32_t value, uint8_t *buf)
{
    uint8_t i = 0;
    uint32_t u_val;

    // 1. 負の数の処理
    if (value < 0) {
        buf[i++] = '-';
        u_val = (uint32_t)(-(value + 1)) + 1;
    } else {
        u_val = (uint32_t)value;
    }

    // 2. 整数部と小数部の分離 (100万 = 1,000,000)
    uint32_t integer = 0;
    while (u_val >= 1000000) {
        u_val -= 1000000;
        integer++;
    }
    uint32_t fraction = u_val; // 0-999,999

    // 3. 整数部の出力 (経度180度まで対応: 百の位から開始)
    uint32_t div_int = 100;
    uint8_t started = 0;
    while (div_int > 0) {
        uint8_t digit = 0;
        while (integer >= div_int) {
            integer -= div_int;
            digit++;
        }
        if (started || digit > 0 || div_int == 1) {
            buf[i++] = digit + '0';
            started = 1;
        }
        // div_int /= 10 の代わり
        if      (div_int == 100) div_int = 10;
        else if (div_int == 10)  div_int = 1;
        else                     div_int = 0;
    }

