grekichi/raspberry_pi_asm/rp2040/uart/get_gps/get_gps.c
    // 4. 小数点
    buf[i++] = '.';

    // 5. 小数部の出力 (常に6桁固定)
    uint32_t div_frac = 100000;
    while (div_frac > 0) {
        uint8_t f_digit = 0;
        while (fraction >= div_frac) {
            fraction -= div_frac;
            f_digit++;
        }
        buf[i++] = f_digit + '0';

        // div_frac /= 10 の代わり
        if      (div_frac == 100000) div_frac = 10000;
        else if (div_frac == 10000)  div_frac = 1000;
        else if (div_frac == 1000)   div_frac = 100;
        else if (div_frac == 100)    div_frac = 10;
        else if (div_frac == 10)     div_frac = 1;
        else                         div_frac = 0;
    }

    buf[i] = '\0';
}

typedef struct
{
    // 日付(JST)
    uint8_t year; // 00 ~ 99 (2000年 ~ 2099年)
    uint8_t month;
    uint8_t day;
    // 時刻(JST)
    uint8_t hour;
    uint8_t minute;
    uint8_t second;
    // 座標(マイクロ度: 1.0度 = 1,000,000)
    // 34.686280度 -> 34686280
    int32_t latitude;
    int32_t longitude;
    // 速度(100倍km/h)
    // 12.53km/h -> 1253
    uint32_t speed;
    // ステータス(1: 有効, 0:無効)
    uint8_t valid;
} GPS_Data;

// 10倍速算
uint32_t mul10(uint32_t n)
{
    return (n << 3) + (n << 1);
}

// 文字列から整数への変換
uint32_t atoui(const char *s, uint32_t len)
{
    uint32_t res = 0;
    for (uint32_t i = 0; i < len; i++)
    {
        if (s[i] >= '0' && s[i] <= '9')
        {
            res = mul10(res) + (uint32_t)(s[i] - '0');
        }
        else
        {
            break;
        }
    }
    return res;
}

/* --- 除算の代用関数 --- */
// n/10 を計算 (上位ビット救出法)
uint32_t div10(uint32_t n)
{
    // マジックナンバー0x66666667(2^34/10相当)を分割して掛ける
    // (n >> 1) * 0.2に相当する計算を構成
    uint32_t i;
    uint32_t q = (n >> 1) + (n >> 2);
    q = q + (q >> 4);
    q = q + (q >> 8);
    q = q + (q >> 16);
    q = q >> 3;
    // 最後に誤差を補正 (n - q*10 が10以上ならqをインクリメント)
    uint32_t r = n - mul10(q);
    return q + ((r + 6) >> 4);  // 簡易補正
}

uint32_t div100(uint32_t n)
{
    return div10(div10(n));
}

uint32_t div1000(uint32_t n)
{
    return div10(div100(n));
}


// --- カレンダー補正処理 ---
// 各月の末日テーブル
// ※ 最初の"0"はダミー
static const uint8_t lastday_in_month[] = {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};

void adjust_jst_calender(GPS_Data *out)
{
    // 日にちを+1
    out->day++;

    // 閏年判定
    uint8_t last_day = lastday_in_month[out->month];
    if (out->month == 2)
    {
        // 2000年〜2099年限定の簡易判定：4で割り切れれば閏年
        // (year & 0x03) == 0 は、「4で割った余りが0」と同じ
        if ((out->year & 0x03) == 0)
        {
            last_day = 29;
        }
    }

    // 月末の繰り上がりチェック
    if (out->day > last_day)
    {
        out->day = 1;  // 1日に戻す
        out->month++;  // 月を+1

        // 年末の繰り上がりチェック
        if (out->month > 12)
        {
            out->month = 1;  // 1月に戻す
            out->year++;     // 年を+1
        }
    }
}

// 度分(DDmm.mmmm)をマイクロ度に変換
static int32_t parse_coord(char *s)
{
    if (!s || *s == '\0') return 0;

    char *dot = 0;
    for (char *p = s; *p; p++)
    {
        if (*p == '.')
        {
            dot = p;
            break;
        }
    }
    if (!dot || (dot - s) < 2) return 0;

    // DEBUG 1
    uart_send_str("[DEBUG] Raw String: ");
    uart_send_str(s);
    uart_line_break();
    
    // 度の抽出
    int32_t deg_len = (int32_t)(dot - 2 - s); // 小数点の２文字前までが「度」
    uint32_t deg = atoui(s, (uint32_t)deg_len);
    
    // 分(整数)の抽出（ドットの直前２文字）
    uint32_t min_int = atoui(dot - 2, 2);
    
    // 分(少数)の抽出（5桁固定で取得する）
    uint32_t min_frac = 0;
    for (int i = 0; i < 5; i++)
    {
        char c = dot[1 + i];

        if (c >= '0' && c <= '9')
        {
            min_frac = (min_frac * 10) + (c - '0');
        }
        else
        {
            // 小数桁が５桁に満たない場合の補正
            // 5桁に満たない場合は、後ろに0を補間する
            for (int j = i; j < 5; j++)
            {
                min_frac *= 10;
            }
            break;
        }
    }

    // DEBUG 2
    uint8_t def_deg[6];
    uint8_t def_minint[10];
    uint8_t def_minfrac[10];
    int2str(deg, def_deg);
    int2str(min_int, def_minint);
    int2str_for_gps(min_frac, def_minfrac);
    uart_send_str("[DEBUG] deg: ");
    uart_send_str(def_deg);
    uart_send_str(" min_int: ");
    uart_send_str(def_minint);
    uart_send_str(" min_frac: ");
    uart_send_str(def_minfrac);
    uart_line_break();
    
    // 「分」をマイクロ単位(10^-6)に統合 ex: 41.16963分 -> 41,169,630 (*6桁化のため10倍)
    uint32_t total_min_u = (min_int * 1000000) + (min_frac * 10);

    // 分/60を計算する(引き算ステップ法)
    uint32_t min_in_deg = 0;
    uint32_t steps[] = {6000000, 600000, 60000, 6000, 600, 60};
    uint32_t vals[] = {100000, 10000, 1000, 100, 10, 1};

    for (int i = 0; i < 6; i++)
    {
        while (total_min_u >= steps[i])
        {
            total_min_u -= steps[i];
            min_in_deg += vals[i];
        }
    }

    // 100万倍した度を返す
    return (deg * 1000000) + min_in_deg;
}

static void parse_gprmc(char *line, GPS_Data *out) {
    char *fields[11];
    uint8_t f_idx = 0;
    char *p = line;

    // カンマ分割
    fields[f_idx++] = p;
    while (*p)
    {
        if (*p == ',')
        {
            *p = '\0';
            if (f_idx < 11)
            {
                fields[f_idx++] = p + 1;
            }
        }
        p++;
    }

    if (f_idx < 10 || fields[2][0] != 'A')
    {
        out->valid = 0;
        return;
    }
    out->valid = 1;

    // 時刻の解析 (UTC -> JST)
    uint8_t h = (uint8_t)atoui(fields[1], 2);
    h += 9;
    // 日付の繰り上がりフラグ
    uint8_t day_offset = 0;
    if (h >= 24)
    {
        h -= 24; // 単純な減算で24の剰余
        day_offset = 1;
    }

    out->hour   = h;
    out->minute = (uint8_t)atoui(fields[1] + 2, 2);
    out->second = (uint8_t)atoui(fields[1] + 4, 2);

    // 日付の解析
    // fields[9]に"140426" (2026年4月14日)の形式で格納されている
    out->day   = (uint8_t)atoui(fields[9], 2);
    out->month = (uint8_t)atoui(fields[9] + 2, 2);
    out->year  = (uint8_t)atoui(fields[9] + 4, 2);

    // 日本時間補正による日付の繰り上がり処理
    if (day_offset)
    {
        adjust_jst_calender(out);
    }

    // 座標
    out->latitude = parse_coord(fields[3]);
    if (fields[4][0] == 'S') out->latitude = -out->latitude;
    
    out->longitude = parse_coord(fields[5]);
    if (fields[6][0] == 'W') out->longitude = -out->longitude;

