grekichi/raspberry_pi_asm/rp2040/uart/get_gps/get_gps.c
    // 速度 (knot -> km/h x100)
    // 1 knot = 1.852 km/h -> x185.2
    // 割り算を避けるため 185倍して100で割るのではなく、
    // 固定小数として (knot * 185) + (knot * 2 / 10)
    uint32_t knots = atoui(fields[7], 5); // 小数点無視で取得
    out->speed = div100(knots * 185);
}

// NMEAセンテンスのチェックサムの検証
static int32_t verify_gps_checksum(const char *s)
{
    uint8_t crc = 0;

    // 先頭の '$' をスキップ
    if (*s == '$') s++;

    // '*' または終端文字が来るまでXOR計算
    while (*s && *s != '*')
    {
        crc ^= (uint8_t)*s;
        s++;
    }

    // '*' が見つからなかった場合はエラー
    if (*s != '*') return 0;
    s++;

    // 文字列内のチェックサム(16進数2桁)を数値に変換
    uint8_t received_crc = 0;
    for (int i = 0; i < 2; i++)
    {
        uint8_t c = (uint8_t)s[i];
        received_crc <<= 4;
        if (c >= '0' && c <= '9') received_crc += (c - '0');
        else if (c >= 'A' && c <= 'F') received_crc += (c - 'A' + 10);
        else if (c >= 'a' && c <= 'f') received_crc += (c - 'a' + 10);
        else return 0; // 不正な文字
    }

    // 計算値と受信値を比較
    return (crc == received_crc);
}

static void check_gps_receive_rate(void)
{
    static uint32_t rmc_count = 0;
    static uint32_t last_time_us = 0;

    uint32_t current_time_us = GET32(TIMER_TIMELR_RW);

    rmc_count++;

    // 1秒経過判定
    if (current_time_us - last_time_us >= 1000000)
    {
        uint8_t buf_count[6];
        int2str(rmc_count, buf_count);
        uart_send_str("[GPS Stats] ");
        uart_send_str(buf_count);
        uart_send_str(" Hz");
        uart_line_break();

        rmc_count = 0;
        last_time_us = current_time_us;
    }
}

#define MAX_NMEA_LENGTH 128

static void receive_gps(GPS_Data *out)
{
    static char buf_gps[MAX_NMEA_LENGTH];
    static uint8_t idx = 0;

    // データの有無を確認
    while (!(GET32(UART1_FR_RW) & (1 << 4)))
    {
        // データがある場合
        uint8_t c = (uint8_t)(GET32(UART1_DR_RW) & 0xFF);

        if (c == '$') idx = 0;

        if (idx < (MAX_NMEA_LENGTH - 1))
        {
            buf_gps[idx++] = c;

            if (c == '\n')
            {
                buf_gps[idx] = '\0';

                // // DEBUG
                // check_gps_receive_rate();
                // uart_send_str("RAW_GPS: ");
                // uart_send_str(buf_gps);
                // uart_line_break();
                // parse_gprmc(buf_gps, out);

                // チェックサムの正誤検証
                if (verify_gps_checksum(buf_gps))
                {
                    uart_send_str("UART Checksum OK");
                    uart_line_break();
                    // // チェックサムが正しい場合のみ以下の処理を実行
                    parse_gprmc(buf_gps, out);
                    uart_send_str("Parse Success!");
                    uart_line_break();
                }
                else
                {
                    uart_send_str("GPS Checksum error");
                    uart_line_break();
                }
                idx = 0; // 次の受信のためにリセット
            }
        }
    }
}

// baudrate=9600の場合  : ibrd->813, fbrd->52
// baudrate=57600の場合 : ibrd->135, fbrd->41
// baudrate=115200の場合: ibrd-> 67, fbrd->53
static void update_gps_baudrate(uint8_t *array, uint32_t ibrd, uint32_t fbrd)
{
    for (int i = 0; i < 28; i++)
    {
        while (GET32(UART1_FR_RW) & (1 << 5));
        PUT32(UART1_DR_RW, array[i]);
    }

    // 送信完了を待機
    while (!(GET32(UART1_FR_RW) & (1 << 7)));
    while (GET32(UART1_FR_RW) & (1 << 3));
    delay_ms(10);

    // RP2040側のボーレート変更設定
    set_uart1_baudrate(ibrd, fbrd);
    delay_ms(10);
}

static void set_ubx_checksum(uint8_t *array, int size)
{
    uint8_t ck_a = 0;
    uint8_t ck_b = 0;

    // インデックス2(Class)からsize-2(チェックサムの手前)まで計算
    for (int i = 2; i < size - 2; i++)
    {
        ck_a = ck_a + array[i];
        ck_b = ck_b + ck_a;
    }

    array[size - 2] = ck_a;
    array[size - 1] = ck_b;
}

static void change_neo6_setting(uint8_t *array, uint32_t len)
{
    for (int i = 0; i < len; i++)
    {
        while (GET32(UART1_FR_RW) & (1 << 5));
        PUT32(UART1_DR_RW, array[i]);
    }

    // 送信完了を待機
    while (!(GET32(UART1_FR_RW) & (1 << 7)));
    while (GET32(UART1_FR_RW) & (1 << 3));
}

static void set_gps_msg_only_rmc(void)
{
    // 停止対象メッセージID: GGA(00), GLL(01), GSA(02), GSV(03), VTG(05)
    uint8_t ids[] = {0x00, 0x01, 0x02, 0x03, 0x05};

    for (int i = 0; i < 5; i++)
    {
        uint8_t cmd[] = {
            0xB5, 0x62,   // Header
            0x06, 0x01,   // CFG-MSG
            0x03, 0x00,   // Length
            0xF0, ids[i], // NMEA Class, Message ID
            0x00,         // Rate: 0 (無効化)
            0x00, 0x00    // Checksum
        };
        // 明示的に11バイトと指定
        set_ubx_checksum(cmd, 11);

        // 送信
        change_neo6_setting(cmd, 11);
        delay_ms(100);
    }
    delay_ms(400);
}

volatile uint32_t systick_ms = 0;
void Systick_Handler(void)
{
    systick_ms++;
    if (systick_ms >= 1000)
    {
        systick_ms = 0;
        PUT32(SIO_GPIO_OUT_XOR, 1 << 20); // GPIO25出力を切替(picoWでは20とする)
    }
}

int get_gps(void)
{
    clock_init();
    reset_subsys();
    led_init();
    uart0_init();
    uart1_init();
    
    PUT32(SYST_RVR, 125000 - 1); // 125MHz設定のため、1msカウントにセット（1s設定できないため）
    PUT32(SYST_CVR, 0);          // 125MHz設定のため、1msカウントにセット（1s設定できないため）
    PUT32(SYST_CSR, 0x07);       // プロセッサクロック使用、例外ステータス保留、カウンター有効

    static const uint8_t ubx_cfg_baud_57600[] = {
        0xB5, 0x62,             // Sync Char (Header)
        0x06, 0x00,             // Class: 0x06(CFG), ID: 0x00(PRT)
        0x14, 0x00,             // Payload Length: 20 bytes (Little Endian)
        0x01,                   // Port ID (1 = UART1)
        0x00,                   // Reserved
        0x00, 0x00,             // TX Ready Pins(0)
        0xD0, 0x08, 0x00, 0x00, // Mode: 8bit, No parity, Stop bit 1 (0x000008D0)
        0x00, 0xE1, 0x00, 0x00, // Baudrate: 57600 (0x0000E100)
        0x03, 0x00,             // InProto Mask: UBX + NMEA (0x0003)
        0x03, 0x00,             // OutProto Mask: UBX + NMEA (0x0003)
        0x00, 0x00,             // Flags (0)
        0x00, 0x00,             // Reserved (0)
        0x0E, 0xB1              // Checksum (CK_A, CK_B)
    };

    static const uint8_t ubx_cfg_rate_5hz[] = {
        0xB5, 0x62, // Sync Char (Header)
        0x06, 0x08, // Class: 0x06 (CFG), ID: 0x08 (RATE)
        0x06, 0x00, // Payload Length: 6 bytes (Little Endian)
        0xC8, 0x00, // measRate: 200ms (1/0.2 = 5Hz)
        0x01, 0x00, // navRate: 1 (Every 1 measurement)
        0x01, 0x00, // timeRef: 1 (GPS Time)
        0xDE, 0x6A  // Checksum (CK_A, CK_B)
    };

    // update_gps_baudrate(ubx_cfg_baud_57600, 135, 41);
    // uart_send_str("NEO6M baudrate updated to 57,600 bps");
    // uart_line_break();
    set_gps_msg_only_rmc();
    uart_send_str("NEO6M setting changed: GPRMC only reading");
    uart_line_break();
    change_neo6_setting(ubx_cfg_rate_5hz, 14);
    uart_send_str("NEO6M setting changed: CFG rate 5Hz");
    uart_line_break();

    // GPS受信変数
    GPS_Data NEO6M;
    uint8_t buf_lat[16];
    uint8_t buf_lon[16];

    while (1)
    {
        WFI();

        receive_gps(&NEO6M);

        frac2str4gps(NEO6M.latitude, buf_lat);
        frac2str4gps(NEO6M.longitude, buf_lon);

        uart_send_str(buf_lat);
        uart_line_break();
        uart_send_str(buf_lon);
        uart_line_break();
    }

    return 0;
}

//-------------------------------------------------------------------------
//
// Copyright (c) 2026 grekichi
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------
//
